splice> AUTOCOMMIT OFF;
splice> -- MODULE DML021

-- SQL Test Suite, V6.0, Interactive SQL, dml021.sql
-- 59-byte ID
-- TEd Version #
                                                                   
-- AUTHORIZATION HU
   set schema HU;
0 rows inserted/updated/deleted
splice> --O   SELECT USER FROM HU.ECCO;
  VALUES USER;
1                                                                                                                               
--------------------------------------------------------------------------------------------------------------------------------
HU                                                                                                                              
splice> -- RERUN if USER value does not match preceding AUTHORIZATION comment

-- date_time print

-- TEST:0084 Data type CHAR(20)!

-- setup
     INSERT INTO AA
            VALUES('abcdefghspliceklmnopqrst');
1 row inserted/updated/deleted
splice> -- PASS:0084 If 1 row is inserted?
                                                             
     SELECT CHARTEST                                                   
          FROM   AA;
CHARTEST            
--------------------
abcdefghspliceklmnopqrst
splice> -- PASS:0084 If CHARTEST = 'abcdefghspliceklmnopqrst' ?

-- restore
     ROLLBACK WORK;
splice> -- END TEST >>> 0084 <<< END TEST
-- *************************************************************

-- TEST:0173 Data type CHAR!

-- setup
     INSERT INTO BB
            VALUES('a');
1 row inserted/updated/deleted
splice> -- PASS:0173 If 1 row is inserted?

     SELECT CHARTEST                                                    
          FROM BB;
CHA&
----
a   
splice> -- PASS:0173 If CHARTEST = 'a'?

-- restore
     ROLLBACK WORK;
splice> -- END TEST >>> 0173 <<< END TEST
-- *****************************************************************

-- TEST:0085 Data type CHARACTER(20)!

-- setup
     INSERT INTO CC
            VALUES('abcdefghspliceklmnopqrst');
1 row inserted/updated/deleted
splice> -- PASS:0085 If 1 row is inserted?

     SELECT CHARTEST                                                   
          FROM CC;
CHARTEST            
--------------------
abcdefghspliceklmnopqrst
splice> -- PASS:0085 If CHARTEST = 'abcdefghspliceklmnopqrst'?

-- restore
     ROLLBACK WORK;
splice> -- END TEST >>> 0085 <<< END TEST
-- *************************************************************

-- TEST:0174 Data type CHARACTER!

-- setup
     INSERT INTO DD
            VALUES('a');
1 row inserted/updated/deleted
splice> -- PASS:0174 If 1 row is inserted?
           
     SELECT CHARTEST                                                    
          FROM DD;
CHA&
----
a   
splice> -- PASS:0174 If CHARTEST = 'a'?

-- restore
     ROLLBACK WORK;
splice> -- END TEST >>> 0174 <<< END TEST
-- ****************************************************************

-- TEST:0086 Data type INTEGER!

-- setup
     INSERT INTO EE
            VALUES(123456);
1 row inserted/updated/deleted
splice> -- PASS:0086 If 1 row is inserted?
                       
     SELECT INTTEST                                                     
          FROM EE;
INTTEST    
-----------
123456     
splice> -- PASS:0086 If INTTEST = 123456?

-- restore
     ROLLBACK WORK;
splice> -- END TEST >>> 0086 <<< END TEST
-- ***************************************************************

-- TEST:0087 Data type INT!

-- setup 
     INSERT INTO FF
            VALUES(123456);
1 row inserted/updated/deleted
splice> -- PASS:0087 If 1 row is inserted?
                
     SELECT INTTEST  
          FROM FF;
INTTEST    
-----------
123456     
splice> -- PASS:0087 If INTTEST = 123456?

-- restore
     ROLLBACK WORK;
splice> -- END TEST >>> 0087 <<< END TEST
-- **************************************************************

-- TEST:0089 Data type SMALLINT!

-- setup
     INSERT INTO HH
            VALUES(123);
1 row inserted/updated/deleted
splice> -- PASS:0089 If 1 row is inserted?

     SELECT *
          FROM HH;
SMALL&
------
123   
splice> -- PASS:0089 If SMALLTEST = 123?

-- restore
     ROLLBACK WORK;
splice> -- END TEST >>> 0089 <<< END TEST
-- ****************************************************************

-- TEST:0175 Data type NUMERIC!

-- setup
     INSERT INTO MM
            VALUES(7);
1 row inserted/updated/deleted
splice> -- PASS:0175 If 1 row is inserted?

     SELECT *
          FROM MM;
NUMTE&
------
7     
splice> -- PASS:0175 If NUMTEST = 7?

-- restore
     ROLLBACK WORK;
splice> -- END TEST >>> 0175 <<< END TEST
-- ****************************************************************

-- TEST:0176 Data type NUMERIC(9), SELECT *!

-- making sure table is empty
     DELETE FROM NN;
0 rows inserted/updated/deleted
WARNING 02000: No row was found for FETCH, UPDATE or DELETE; or the result of a query is an empty table.
splice> -- setup
     INSERT INTO NN
            VALUES(123456789);
1 row inserted/updated/deleted
splice> -- PASS:0176 If 1 row is inserted?

     SELECT *
          FROM NN;
NUMTEST   
----------
123456789 
splice> -- PASS:0176 If NUMTEST = 123456789 ?

-- restore
     ROLLBACK WORK;
splice> -- END TEST >>> 0176 <<< END TEST
-- *****************************************************************

-- TEST:0177 Data type NUMERIC(9), SELECT column!

-- setup
     INSERT INTO OO
            VALUES(123456789);
1 row inserted/updated/deleted
splice> -- PASS:0177 If 1 row is inserted ?

     SELECT NUMTEST
          FROM OO;
NUMTEST   
----------
123456789 
splice> -- PASS:0177 If NUMTEST = 123456789?

-- restore
     ROLLBACK WORK;
splice> -- END TEST >>> 0177 <<< END TEST
-- **************************************************************

-- TEST:0178 Data type DECIMAL!

-- setup
     INSERT INTO QQ
            VALUES(56);
1 row inserted/updated/deleted
splice> -- PASS:0178 If 1 row is inserted?

     SELECT *
          FROM QQ;
NUMTE&
------
56    
splice> -- PASS:0178 If NUMTEST = 56?

-- restore
     ROLLBACK WORK;
splice> -- END TEST >>> 0178 <<< END TEST
-- **************************************************************

-- TEST:0179 Data type DECIMAL(8)!

-- setup
     INSERT INTO RR
            VALUES(12345678);
1 row inserted/updated/deleted
splice> -- PASS:0179  If 1 row is inserted?

     SELECT *
          FROM RR;
NUMTEST  
---------
12345678 
splice> -- PASS:0179 If NUMTEST = 12345678?

-- restore
     ROLLBACK WORK;
splice> -- END TEST >>> 0179 <<< END TEST
-- *************************************************////END-OF-MODULE
;
splice> 
